# ForwardIterator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PaperSourceSet..::..ForwardIterator Method
PaperSourceSet Class See Also
---
Retrieve a forward moving iterator to the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual PaperSourceSetIterator ForwardIterator()
```

Visual Basic
---
```text
Public Overridable Function ForwardIterator As PaperSourceSetIterator
```

Visual C++
---
```text
public:
virtual PaperSourceSetIterator^ ForwardIterator()
```

# ### Return Value
Returns a forward moving iterator to the set.
# See Also
PaperSourceSet Class
Autodesk.Revit.DB Namespace